{
  "format": "graph-model",
  "generatedBy": "2.4.0",
  "convertedBy": "TensorFlow.js Converter v3.15.0",
  "modelTopology": {
    "node": [
      {
        "name": "up_sampling2d_1/resize/ResizeNearestNeighbor",
        "op": "ResizeNearestNeighbor",
        "input": ["conv2d_15/Relu"],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "align_corners": {"b": false},
          "half_pixel_centers": {"b": false},
          "size": {"list": {"i": ["128", "128"]}}
        }
      },
      {
        "name": "conv2d_16/Conv2D",
        "op": "Conv2D",
        "input": ["up_sampling2d_1/resize/ResizeNearestNeighbor", "conv2d_16/kernel"],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "data_format": {"s": "TkhXQw=="},
          "dilations": {"list": {"i": ["1", "1", "1", "1"]}},
          "explicit_paddings": {"list": {}},
          "padding": {"s": "U0FNRQ=="},
          "strides": {"list": {"i": ["1", "1", "1", "1"]}},
          "use_cudnn_on_gpu": {"b": true}
        }
      },
      {
        "name": "conv2d_16/BiasAdd",
        "op": "BiasAdd",
        "input": ["conv2d_16/Conv2D", "conv2d_16/bias"],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "data_format": {"s": "TkhXQw=="}
        }
      },
      {
        "name": "conv2d_16/Relu",
        "op": "Relu",
        "input": ["conv2d_16/BiasAdd"],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "conv2d_17/Conv2D",
        "op": "Conv2D",
        "input": ["conv2d_16/Relu", "conv2d_17/kernel"],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "data_format": {"s": "TkhXQw=="},
          "dilations": {"list": {"i": ["1", "1", "1", "1"]}},
          "explicit_paddings": {"list": {}},
          "padding": {"s": "U0FNRQ=="},
          "strides": {"list": {"i": ["1", "1", "1", "1"]}},
          "use_cudnn_on_gpu": {"b": true}
        }
      },
      {
        "name": "conv2d_17/BiasAdd",
        "op": "BiasAdd",
        "input": ["conv2d_17/Conv2D", "conv2d_17/bias"],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "data_format": {"s": "TkhXQw=="}
        }
      },
      {
        "name": "conv2d_17/Relu",
        "op": "Relu",
        "input": ["conv2d_17/BiasAdd"],
        "attr": {"T": {"type": "DT_FLOAT"}}
      }
    ],
    "library": {},
    "versions": {"producer": 1075}
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {"name": "conv2d_16/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"},
        {"name": "conv2d_16/bias", "shape": [64], "dtype": "float32"},
        {"name": "conv2d_17/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"},
        {"name": "conv2d_17/bias", "shape": [3], "dtype": "float32"}
      ]
    }
  ]
}