{
  "format": "graph-model",
  "generatedBy": "2.0.0",
  "convertedBy": "TensorFlow.js Converter v1.7.0",
  "signature": {
    "inputs": {
      "input_1": {
        "name": "input_1:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {
              "size": "-1"
            },
            {
              "size": "-1"
            },
            {
              "size": "-1"
            },
            {
              "size": "3"
            }
          ]
        }
      }
    },
    "outputs": {
      "conv2d_41": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {
              "size": "-1"
            },
            {
              "size": "-1"
            },
            {
              "size": "-1"
            },
            {
              "size": "3"
            }
          ]
        }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/model/conv2d/Conv2D",
        "op": "Conv2D",
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "strides": {
            "list": {
              "i": ["1", "1", "1", "1"]
            }
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "padding": {
            "s": "U0FNRQ=="
          },
          "dilations": {
            "list": {
              "i": ["1", "1", "1", "1"]
            }
          },
          "explicit_paddings": {
            "list": {}
          }
        },
        "input": [
          "input_1",
          "StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp"
        ]
      },
      {
        "name": "StatefulPartitionedCall/model/conv2d/BiasAdd",
        "op": "BiasAdd",
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "data_format": {
            "s": "TkhXQw=="
          }
        },
        "input": [
          "StatefulPartitionedCall/model/conv2d/Conv2D",
          "StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp"
        ]
      },
      {
        "name": "StatefulPartitionedCall/model/leaky_re_lu/LeakyRelu",
        "op": "LeakyRelu",
        "attr": {
          "alpha": {
            "f": 0.20000000298023224
          },
          "T": {
            "type": "DT_FLOAT"
          }
        },
        "input": ["StatefulPartitionedCall/model/conv2d/BiasAdd"]
      }
    ]
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp",
          "shape": [3, 3, 3, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        }
      ]
    }
  ]
}
